In [1]:
# abc
print("Pakistan")
# xyz

Pakistan

In [2]:
abc
print("Pakistan")
xyz

NameError: name 'abc' is not defined

In [ ]:
print(1)
# print(2)
# print(3)
print(4)

In [3]:
print(1)
"""
print(2)
print(3)
"""

print(4)

1
4

In [1]:
def my_sum(x1,*x):
    """
    we created this function in NED class
    you can add one or more numbers
    """
    return x1+sum(x)

my_sum(2,3,4,5)

14

In [8]:
help(my_sum)

Help on function my_sum in module __main__:

my_sum(x1, *x)
    we created this function in NED class
    you can add one or more numbers

In [2]:
print?

In [3]:
print??

In [4]:
?print

In [5]:
??print

In [7]:
help(dir)

Help on built-in function dir in module builtins:

dir(...)
    dir([object]) -> list of strings

    If called without an argument, return the names in the current scope.
    Else, return an alphabetized list of names comprising (some of) the attributes
    of the given object, and of attributes reachable from it.
    If the object supplies a method named __dir__, it will be used; otherwise
    the default dir() logic is used and returns:
      for a module object: the module's attributes.
      for a class object:  its attributes, and recursively the attributes
        of its bases.
      for any other object: its attributes, its class's attributes, and
        recursively the attributes of its class's base classes.

In [ ]:
my_sum?

In [ ]:
codeInString = 'a = 8\nb=7\nsum=a+b\nprint("sum =",sum)'
codeObject = compile(codeInString, 'sumstring', 'exec')

exec(codeObject)

# Output: 15

In [9]:
codeInString = """
a = 7
b = 20
c = a + b
print("A+B=",c)
"""
codeObject = compile(codeInString,"aa",'exec')

exec(codeObject)

# Output: 15

A+B= 27

In [11]:
a = input("number1: ")
b = input("number2: ")
print(type(a), type(b))
print(a + b)

number1: 1
number2: 1
<class 'str'> <class 'str'>
11

In [13]:
a = int(input("number1: "))
b = int(input("number2: "))
print(type(a), type(b))
print(a + b)

number1: 1
number2: 1
<class 'int'> <class 'int'>
2

In [ ]:
"ABCDEFGHIJKLMNOPQRSTUVWXYZ"

In [14]:
list("ABCDEFGHIJKLMNOPQRSTUVWXYZ")

['A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U',
 'V',
 'W',
 'X',
 'Y',
 'Z']

In [15]:
keys = ['a','b','c']
values = [1,2,3]

{k:v for k,v in zip(keys,values)}

{'a': 1, 'b': 2, 'c': 3}

In [16]:
dict(keys,values)

TypeError: dict expected at most 1 argument, got 2

In [17]:
data = {"id":list("123456789"),
       "names":list("ABCDEFJKL")}
data

{'id': ['1', '2', '3', '4', '5', '6', '7', '8', '9'],
 'names': ['A', 'B', 'C', 'D', 'E', 'F', 'J', 'K', 'L']}

In [20]:
import pandas as pd

df = pd.DataFrame(data)

df

  id names
0  1     A
1  2     B
2  3     C
3  4     D
4  5     E
5  6     F
6  7     J
7  8     K
8  9     L

In [21]:
names = []

while True:
    name = input("Enter name or X for exit")
    if name == 'x' or name == "X" or name=="exit":
        break
    names.append(name)
    
names

Enter name or X for exitsadaf
Enter name or X for exitsidra
Enter name or X for exityasmeen
Enter name or X for exitx

['sadaf', 'sidra', 'yasmeen']

In [22]:
l1 = list("abc")
print(l1)
l2 = list('xyz')
print(l2)

l1.append(l2)

print(l1)

['a', 'b', 'c']
['x', 'y', 'z']
['a', 'b', 'c', ['x', 'y', 'z']]

In [23]:
l1 = list("abc")
print(l1)
l2 = list('xyz')
print(l2)

l1.extend(l2)

print(l1)

['a', 'b', 'c']
['x', 'y', 'z']
['a', 'b', 'c', 'x', 'y', 'z']

In [24]:
df = pd.read_excel("data.xlsx")
df

    Name  fname  roll no class
0  sadaf  zahid      201    bs
1  sidra  zahid      202    bs
2  rabia   alam      203    bs

In [25]:
df = pd.read_excel("F:\pythonlearning\class4\data.xlsx")
df

    Name  fname  roll no class
0  sadaf  zahid      201    bs
1  sidra  zahid      202    bs
2  rabia   alam      203    bs

In [26]:
df = pd.read_csv("F:\pythonlearning\class4\data.csv")
df

    Name  fname  roll no class
0  sadaf  zahid      201    bs
1  sidra  zahid      202    bs
2  rabia   alam      203    bs

In [27]:
df.Name  #single word or without space column name
#cant add new column with this style

0    sadaf
1    sidra
2    rabia
Name: Name, dtype: object

In [28]:
df['Name']   # add column

0    sadaf
1    sidra
2    rabia
Name: Name, dtype: object

In [31]:
df['Name'].apply(str.upper)

0    SADAF
1    SIDRA
2    RABIA
Name: Name, dtype: object

In [32]:
df

    Name  fname  roll no class
0  sadaf  zahid      201    bs
1  sidra  zahid      202    bs
2  rabia   alam      203    bs

In [33]:
df['Name'] = df['Name'].apply(str.upper)

In [34]:
df

    Name  fname  roll no class
0  SADAF  zahid      201    bs
1  SIDRA  zahid      202    bs
2  RABIA   alam      203    bs

In [35]:
df.to_excel("output.xlsx", index=True)

In [36]:
df.to_excel("output1.xlsx", index=False)

In [ ]:
df1 = pd.read_excel("E:\PGD_Data_Science\Class3\data.xlsx")
df1